[Killed] ObjectLiteral
main/components/RiderApplication/RiderApplicationEditForm.js:15:17
         formState: { errors },
         handleSubmit,
         getValues
-    } = useForm({ defaultValues: initialContents });
+    } = useForm({});
 
     const testIdPrefix = "RiderApplicationEditForm";
killedBy: RiderApplicationEditPageAdmin tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(element).toHaveValue(random@example.org)

Expected the element to have value:
  random@example.org
Received:

[Killed] StringLiteral
main/components/RiderApplication/RiderApplicationEditForm.js:44:59
     };
 
     const handleApprove = async () => {
-        const updatedData = { ...initialContents, status: 'accepted', notes: getValues("notes") };
+        const updatedData = { ...initialContents, status: "", notes: getValues("notes") };
         submitAction(updatedData);
         await toggleRiderCallback(initialContents.userId);
killedBy: RiderApplicationEditForm tests handleAction submits data and navigates when approving
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"status": "accepted"}
Received: {"cancelled_date": null, "created_date": "2024-03-06", "description": "This is a test description.", "email": "test@example.com", "id": 1, "notes": "This is a note.", "perm_number": "1234567", "status": "", "updated_date": "2024-03-06", "userId": "user123"}

Number of calls: 1

[Killed] ConditionalExpression
main/components/RiderApplication/RiderApplicationEditForm.js:67:14
 
     return (
         <Form onSubmit={handleSubmit(onSubmit)}>
-            {initialContents && (
-                <Form.Group className="mb-3">
-                    <Form.Label htmlFor="id">Application Id</Form.Label>
-                    <Form.Control
-                        data-testid={testIdPrefix + "-id"}
-                        id="id"
-                        type="text"
-                        {...register("id")}
-                        defaultValue={initialContents?.id}
-                        disabled
-                    />
-                </Form.Group>
-            )}
+            {true}
             {initialContents && (
                 <Form.Group className="mb-3">
killedBy: RiderApplicationEditPageAdmin tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="RiderApplicationEditForm-id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Survived] ConditionalExpression
main/components/RiderApplication/RiderApplicationEditForm.js:80:14
                     />
                 </Form.Group>
             )}
-            {initialContents && (
-                <Form.Group className="mb-3">
-                    <Form.Label htmlFor="userId">Applicant Id</Form.Label>
-                    <Form.Control
-                        data-testid={testIdPrefix + "-userId"}
-                        id="userId"
-                        type="text"
-                        {...register("userId")}
-                        defaultValue={initialContents?.userId}
-                        disabled
-                    />
-                </Form.Group>
-            )}
+            {true}
             {initialContents && (
                 <Form.Group className="mb-3">

[Killed] ConditionalExpression
main/components/RiderApplication/RiderApplicationEditForm.js:93:14
                     />
                 </Form.Group>
             )}
-            {initialContents && (
-                <Form.Group className="mb-3">
-                    <Form.Label htmlFor="status">Status</Form.Label>
-                    <Form.Control
-                        data-testid={testIdPrefix + "-status"}
-                        id="status"
-                        type="text"
-                        {...register("status")}
-                        defaultValue={initialContents?.status}
-                        disabled
-                    />
-                </Form.Group>
-            )}
+            {false}
             <Form.Group className="mb-3">
                 <Form.Label htmlFor="email">Email</Form.Label>
killedBy: RiderApplicationEditPageAdmin tests tests where backend is working normally Is populated with the data provided
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RiderApplicationEditForm-status"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ConditionalExpression
main/components/RiderApplication/RiderApplicationEditForm.js:117:14
                     disabled
                 />
             </Form.Group>
-            {initialContents && (
-                <Form.Group className="mb-3">
-                    <Form.Label htmlFor="created_date">Date Applied</Form.Label>
-                    <Form.Control
-                        data-testid={testIdPrefix + "-created_date"}
-                        id="created_date"
-                        type="text"
-                        {...register("created_date")}
-                        defaultValue={initialContents?.created_date}
-                        disabled
-                    />
-                </Form.Group>
-            )}
+            {true}
             {initialContents && (
                 <Form.Group className="mb-3">
killedBy: RiderApplicationEditPageAdmin tests tests where backend is working normally Is populated with the data provided
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RiderApplicationEditForm-created_date"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] StringLiteral
main/components/RiderApplication/RiderApplicationEditForm.js:134:53
                 <Form.Group className="mb-3">
                     <Form.Label htmlFor="updated_date">Date Updated</Form.Label>
                     <Form.Control
-                        data-testid={testIdPrefix + "-updated_date"}
+                        data-testid={testIdPrefix + ""}
                         id="updated_date"
                         type="text"
killedBy: RiderApplicationEditPageAdmin tests tests where backend is working normally Is populated with the data provided
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RiderApplicationEditForm-updated_date"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] LogicalOperator
main/components/RiderApplication/RiderApplicationEditForm.js:156:14
                     />
                 </Form.Group>
             )}
-            {initialContents && initialContents.status === 'declined' && (
-                <Form.Group className="mb-3">
-                    <Form.Label htmlFor="notes">Notes</Form.Label>
-                    <Form.Control
-                        data-testid={testIdPrefix + "-notes"}
-                        id="notes"
-                        type="text"
-                        {...register("notes")}
-                        defaultValue={initialContents?.notes}
-                        disabled
-                    />
-                </Form.Group>
-            )}
+            {initialContents && initialContents.status === 'declined' || <Form.Group className="mb-3">
+                    <Form.Label htmlFor="notes">Notes</Form.Label>
+                    <Form.Control data-testid={testIdPrefix + "-notes"} id="notes" type="text" {...register("notes")} defaultValue={initialContents?.notes} disabled />
+                </Form.Group>}
             {initialContents && initialContents.status === 'cancelled' && (
                 <Form.Group className="mb-3">
killedBy: RiderApplicationEditPageAdmin tests tests where backend is working normally Is populated with the data provided
statusReason: TestingLibraryElementError: Found multiple elements by: [data-testid="RiderApplicationEditForm-notes"]

Here are the matching elements:

<input
  class="form-control"
  data-testid="RiderApplicationEditForm-notes"
  disabled=""

[Killed] ConditionalExpression
main/components/RiderApplication/RiderApplicationEditForm.js:156:14
                     />
                 </Form.Group>
             )}
-            {initialContents && initialContents.status === 'declined' && (
+            {true && (
                 <Form.Group className="mb-3">
                     <Form.Label htmlFor="notes">Notes</Form.Label>
killedBy: RiderApplicationEditPageAdmin tests tests where backend is working normally Is populated with the data provided
statusReason: TestingLibraryElementError: Found multiple elements by: [data-testid="RiderApplicationEditForm-notes"]

Here are the matching elements:

<input
  class="form-control"
  data-testid="RiderApplicationEditForm-notes"
  disabled=""

[Killed] LogicalOperator
main/components/RiderApplication/RiderApplicationEditForm.js:182:14
                     />
                 </Form.Group>
             )}
-            {initialContents && initialContents.status === 'expired' && (
-                <Form.Group className="mb-3">
-                    <Form.Label htmlFor="notes">Notes</Form.Label>
-                    <Form.Control
-                        data-testid={testIdPrefix + "-notes"}
-                        id="notes"
-                        type="text"
-                        {...register("notes")}
-                        defaultValue={initialContents?.notes}
-                        disabled
-                    />
-                </Form.Group>
-            )}
+            {initialContents && initialContents.status === 'expired' || <Form.Group className="mb-3">
+                    <Form.Label htmlFor="notes">Notes</Form.Label>
+                    <Form.Control data-testid={testIdPrefix + "-notes"} id="notes" type="text" {...register("notes")} defaultValue={initialContents?.notes} disabled />
+                </Form.Group>}
             {initialContents && initialContents.status !== 'declined' && initialContents.status !== 'cancelled' && initialContents.status !== 'expired' && (
                 <Form.Group className="mb-3">
killedBy: RiderApplicationEditPageAdmin tests tests where backend is working normally Is populated with the data provided
statusReason: TestingLibraryElementError: Found multiple elements by: [data-testid="RiderApplicationEditForm-notes"]

Here are the matching elements:

<input
  class="form-control"
  data-testid="RiderApplicationEditForm-notes"
  disabled=""

[Killed] EqualityOperator
main/components/RiderApplication/RiderApplicationEditForm.js:195:74
                     />
                 </Form.Group>
             )}
-            {initialContents && initialContents.status !== 'declined' && initialContents.status !== 'cancelled' && initialContents.status !== 'expired' && (
+            {initialContents && initialContents.status !== 'declined' && initialContents.status === 'cancelled' && initialContents.status !== 'expired' && (
                 <Form.Group className="mb-3">
                     <Form.Label htmlFor="notes">Notes</Form.Label>
killedBy: RiderApplicationEditPageAdmin tests tests where backend is working normally Is populated with the data provided
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RiderApplicationEditForm-notes"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] EqualityOperator
main/components/RiderApplication/RiderApplicationEditForm.js:195:33
                     />
                 </Form.Group>
             )}
-            {initialContents && initialContents.status !== 'declined' && initialContents.status !== 'cancelled' && initialContents.status !== 'expired' && (
+            {initialContents && initialContents.status === 'declined' && initialContents.status !== 'cancelled' && initialContents.status !== 'expired' && (
                 <Form.Group className="mb-3">
                     <Form.Label htmlFor="notes">Notes</Form.Label>
killedBy: RiderApplicationEditPageAdmin tests tests where backend is working normally Is populated with the data provided
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RiderApplicationEditForm-notes"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Survived] StringLiteral
main/components/RiderApplication/RiderApplicationEditForm.js:231:100
                     {...register("description")}
                     defaultValue={initialContents?.description}
                     disabled
-                    style={{ width: '100%', minHeight: '10rem', resize: 'vertical', verticalAlign: 'top' }}
+                    style={{ width: '100%', minHeight: '10rem', resize: 'vertical', verticalAlign: "" }}
                 />
             </Form.Group>

[Killed] LogicalOperator
main/components/RiderApplication/RiderApplicationEditForm.js:234:14
                     style={{ width: '100%', minHeight: '10rem', resize: 'vertical', verticalAlign: 'top' }}
                 />
             </Form.Group>
-            {initialContents && initialContents.status === 'pending' && (
-                <Button
-                    variant="success"
-                    onClick={handleApprove}
-                    data-testid={testIdPrefix + "-approve"}
-                >
-                    Approve
-                </Button>
-            )}
+            {initialContents && initialContents.status === 'pending' || <Button variant="success" onClick={handleApprove} data-testid={testIdPrefix + "-approve"}>
+                    Approve
+                </Button>}
             {initialContents && initialContents.status === 'pending' && (
                 <Button
killedBy: RiderApplicationEditForm tests handleAction submits data and navigates when approving
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RiderApplicationEditForm-approve"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/RiderApplication/RiderApplicationEditForm.js:238:49
                 <Button
                     variant="success"
                     onClick={handleApprove}
-                    data-testid={testIdPrefix + "-approve"}
+                    data-testid={testIdPrefix + ""}
                 >
                     Approve
killedBy: RiderApplicationEditForm tests handleAction submits data and navigates when approving
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RiderApplicationEditForm-approve"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/RiderApplication/RiderApplicationEditForm.js:243:14
                     Approve
                 </Button>
             )}
-            {initialContents && initialContents.status === 'pending' && (
-                <Button
-                    variant="danger"
-                    onClick={handleDeny}
-                    data-testid={testIdPrefix + "-deny"}
-                >
-                    Deny
-                </Button>
-            )}
+            {true}
             {initialContents && initialContents.status === 'pending' && (
                 <Button
killedBy: RiderApplicationEditForm tests handleAction submits data and navigates when denying
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RiderApplicationEditForm-deny"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/RiderApplication/RiderApplicationEditForm.js:243:14
                     Approve
                 </Button>
             )}
-            {initialContents && initialContents.status === 'pending' && (
+            {initialContents || initialContents.status === 'pending' && (
                 <Button
                     variant="danger"
killedBy: RiderApplicationEditForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading 'status')

[Killed] LogicalOperator
main/components/RiderApplication/RiderApplicationEditForm.js:260:14
                     Save
                 </Button>
             )}
-            {initialContents && initialContents.status === 'accepted' && (
-                <Button
-                    variant="danger"
-                    onClick={handleExpired}
-                    data-testid={testIdPrefix + "-expire"}
-                >
-                    Set Status to Expired
-                </Button>
-            )}
+            {initialContents && initialContents.status === 'accepted' || <Button variant="danger" onClick={handleExpired} data-testid={testIdPrefix + "-expire"}>
+                    Set Status to Expired
+                </Button>}
             <Button
                 variant="secondary"
killedBy: RiderApplicationEditForm tests handleAction submits data and navigates when expiring
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RiderApplicationEditForm-expire"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/RiderApplication/RiderApplicationEditForm.js:260:14
                     Save
                 </Button>
             )}
-            {initialContents && initialContents.status === 'accepted' && (
-                <Button
-                    variant="danger"
-                    onClick={handleExpired}
-                    data-testid={testIdPrefix + "-expire"}
-                >
-                    Set Status to Expired
-                </Button>
-            )}
+            {false}
             <Button
                 variant="secondary"
killedBy: RiderApplicationEditForm tests handleAction submits data and navigates when expiring
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RiderApplicationEditForm-expire"]

<body>
  <div>
    <form
      class=""
    >
      <div
