[Timeout] ConditionalExpression
main/components/Nav/AppNavbar.js:93:17
                 )
               }
               {
-                !hasRole(currentUser, "ROLE_DRIVER") && isParticipant(currentUser) && (
-                  <NavDropdown title="Shifts" id="appnavbar-shift-dropdown" data-testid="appnavbar-shift-dropdown" >
-                    <NavDropdown.Item data-testid="appnavbar-shift-dropdown-shifts" as={Link} to="/shift/">Shifts</NavDropdown.Item>
-                  </NavDropdown>
-                )
+                false
               }
               {

[Timeout] LogicalOperator
main/components/Nav/AppNavbar.js:100:17
                 )
               }
               {
-                hasRole(currentUser, "ROLE_DRIVER") && isParticipant(currentUser) && (
+                hasRole(currentUser, "ROLE_DRIVER") || isParticipant(currentUser) && (
                   <NavDropdown title="Shifts" id="appnavbar-shift-dropdown" data-testid="appnavbar-shift-dropdown" >
                     <NavDropdown.Item data-testid="appnavbar-shift-dropdown-shifts" as={Link} to="/shift/">Shifts</NavDropdown.Item>

[Killed] BooleanLiteral
main/components/Nav/AppNavbar.js:128:18
                 )
               }
              {
-                (!hasRole(currentUser, "ROLE_RIDER") && (currentUser.loggedIn)) && (
+                (hasRole(currentUser, "ROLE_RIDER") && (currentUser.loggedIn)) && (
                     <Nav.Link id="appnavbar-applytobearider-link" data-testid="appnavbar-applytoberider" as={Link} to="/apply/rider">Apply to be a Rider</Nav.Link>
                 )
killedBy: AppNavbar tests renders RiderApplicationMember links correctly for member
statusReason: Error: Unable to find an element with the text: Apply to be a Rider. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark sticky-top"
      data-testid="AppNavbar"
      style="background-color: rgb(0, 54, 96);"

[Timeout] LogicalOperator
main/components/Nav/AppNavbar.js:128:18
                 )
               }
              {
-                (!hasRole(currentUser, "ROLE_RIDER") && (currentUser.loggedIn)) && (
+                (!hasRole(currentUser, "ROLE_RIDER") || currentUser.loggedIn) && (
                     <Nav.Link id="appnavbar-applytobearider-link" data-testid="appnavbar-applytoberider" as={Link} to="/apply/rider">Apply to be a Rider</Nav.Link>
                 )
