[Killed] StringLiteral
main/components/RiderApplication/RiderApplicationEditForm.js:19:26
     } = useForm({ defaultValues: initialContents });
     // Stryker restore all
 
-    const testIdPrefix = "RiderApplicationEditForm";
+    const testIdPrefix = "";
 
     const onSubmit = async (data) => {
killedBy: RiderApplicationEditForm tests handleAction submits data and navigates when approving
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RiderApplicationEditForm-approve"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] BlockStatement
main/components/RiderApplication/RiderApplicationEditForm.js:21:38
 
     const testIdPrefix = "RiderApplicationEditForm";
 
-    const onSubmit = async (data) => {
-        submitAction(data);
-    };
+    const onSubmit = async (data) => {};
 
     function cellToAxiosParamsToggleRider(id) {
killedBy: RiderApplicationEditPageAdmin tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Survived] BlockStatement
main/components/RiderApplication/RiderApplicationEditForm.js:25:47
         submitAction(data);
     };
 
-    function cellToAxiosParamsToggleRider(id) {
-        return {
-            url: "/api/admin/users/toggleRider",
-            method: "POST",
-            params: {
-                id: id
-            }
-        };
-    }
+    function cellToAxiosParamsToggleRider(id) {}
 
     // Stryker disable all

[Survived] StringLiteral
main/components/RiderApplication/RiderApplicationEditForm.js:27:18
 
     function cellToAxiosParamsToggleRider(id) {
         return {
-            url: "/api/admin/users/toggleRider",
+            url: "",
             method: "POST",
             params: {

[Survived] ObjectLiteral
main/components/RiderApplication/RiderApplicationEditForm.js:29:21
         return {
             url: "/api/admin/users/toggleRider",
             method: "POST",
-            params: {
-                id: id
-            }
+            params: {}
         };
     }
