[Survived] BlockStatement
main/components/RiderApplication/RiderApplicationEditForm.js:43:47
     );
     // Stryker restore all
 
-    const toggleRiderCallback = async (id) => {
-        toggleRiderMutation.mutate(id);
-    };
+    const toggleRiderCallback = async (id) => {};
 
     const handleApprove = async () => {

[Killed] BlockStatement
main/components/RiderApplication/RiderApplicationEditForm.js:47:39
         toggleRiderMutation.mutate(id);
     };
 
-    const handleApprove = async () => {
-        const updatedData = { ...initialContents, status: 'accepted', notes: getValues("notes") };
-        submitAction(updatedData);
-        await toggleRiderCallback(initialContents.userId);
-        navigate(-1);
-    };
+    const handleApprove = async () => {};
 
     const handleDeny = () => {
killedBy: RiderApplicationEditForm tests handleAction submits data and navigates when approving
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"status": "accepted"}

Number of calls: 0

[Killed] ObjectLiteral
main/components/RiderApplication/RiderApplicationEditForm.js:48:29
     };
 
     const handleApprove = async () => {
-        const updatedData = { ...initialContents, status: 'accepted', notes: getValues("notes") };
+        const updatedData = {};
         submitAction(updatedData);
         await toggleRiderCallback(initialContents.userId);
killedBy: RiderApplicationEditForm tests handleAction submits data and navigates when approving
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"status": "accepted"}
Received: {}

Number of calls: 1

[Killed] UnaryOperator
main/components/RiderApplication/RiderApplicationEditForm.js:51:18
         const updatedData = { ...initialContents, status: 'accepted', notes: getValues("notes") };
         submitAction(updatedData);
         await toggleRiderCallback(initialContents.userId);
-        navigate(-1);
+        navigate(+1);
     };
 
killedBy: RiderApplicationEditForm tests handleAction submits data and navigates when approving
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: -1
Received: 1

Number of calls: 1

<html>

[Killed] BlockStatement
main/components/RiderApplication/RiderApplicationEditForm.js:54:30
         navigate(-1);
     };
 
-    const handleDeny = () => {
-        const updatedData = { ...initialContents, status: 'declined', notes: getValues("notes") };
-        handleAction(updatedData, -1);
-    };
+    const handleDeny = () => {};
 
     const handleExpired = () => {
killedBy: RiderApplicationEditForm tests handleAction submits data and navigates when denying
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"status": "declined"}

Number of calls: 0

[Killed] UnaryOperator
main/components/RiderApplication/RiderApplicationEditForm.js:56:35
 
     const handleDeny = () => {
         const updatedData = { ...initialContents, status: 'declined', notes: getValues("notes") };
-        handleAction(updatedData, -1);
+        handleAction(updatedData, +1);
     };
 
killedBy: RiderApplicationEditForm tests handleAction submits data and navigates when denying
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: -1
Received: 1

Number of calls: 1

<html>

[Killed] BlockStatement
main/components/RiderApplication/RiderApplicationEditForm.js:59:33
         handleAction(updatedData, -1);
     };
 
-    const handleExpired = () => {
-        const updatedData = { ...initialContents, status: 'expired', notes: getValues("notes") };
-        handleAction(updatedData, -1);
-    };
+    const handleExpired = () => {};
 
     const handleAction = (data, navigation) => {
killedBy: RiderApplicationEditForm tests handleAction submits data and navigates when expiring
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"status": "expired"}

Number of calls: 0

[Killed] StringLiteral
main/components/RiderApplication/RiderApplicationEditForm.js:60:59
     };
 
     const handleExpired = () => {
-        const updatedData = { ...initialContents, status: 'expired', notes: getValues("notes") };
+        const updatedData = { ...initialContents, status: "", notes: getValues("notes") };
         handleAction(updatedData, -1);
     };
killedBy: RiderApplicationEditForm tests handleAction submits data and navigates when expiring
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"status": "expired"}
Received: {"cancelled_date": null, "created_date": "2024-03-06", "description": "This is a test description.", "email": "test@example.com", "id": 1, "notes": "This is a note.", "perm_number": "1234567", "status": "", "updated_date": "2024-03-06", "userId": "user123"}

Number of calls: 1

[Killed] UnaryOperator
main/components/RiderApplication/RiderApplicationEditForm.js:61:35
 
     const handleExpired = () => {
         const updatedData = { ...initialContents, status: 'expired', notes: getValues("notes") };
-        handleAction(updatedData, -1);
+        handleAction(updatedData, +1);
     };
 
killedBy: RiderApplicationEditForm tests handleAction submits data and navigates when expiring
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: -1
Received: 1

Number of calls: 1

<html>

[Killed] BlockStatement
main/components/RiderApplication/RiderApplicationEditForm.js:64:48
         handleAction(updatedData, -1);
     };
 
-    const handleAction = (data, navigation) => {
-        submitAction(data);
-        navigate(navigation);
-    };
+    const handleAction = (data, navigation) => {};
 
     return (
killedBy: RiderApplicationEditForm tests handleAction submits data and navigates when denying
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"status": "declined"}

Number of calls: 0

[Killed] ConditionalExpression
main/components/RiderApplication/RiderApplicationEditForm.js:71:14
 
     return (
         <Form onSubmit={handleSubmit(onSubmit)}>
-            {initialContents && (
-                <Form.Group className="mb-3">
-                    <Form.Label htmlFor="id">Application Id</Form.Label>
-                    <Form.Control
-                        data-testid={testIdPrefix + "-id"}
-                        id="id"
-                        type="text"
-                        {...register("id")}
-                        defaultValue={initialContents?.id}
-                        disabled
-                    />
-                </Form.Group>
-            )}
+            {false}
             {initialContents && (
                 <Form.Group className="mb-3">
killedBy: RiderApplicationEditPageAdmin tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="RiderApplicationEditForm-id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] LogicalOperator
main/components/RiderApplication/RiderApplicationEditForm.js:71:14
 
     return (
         <Form onSubmit={handleSubmit(onSubmit)}>
-            {initialContents && (
-                <Form.Group className="mb-3">
-                    <Form.Label htmlFor="id">Application Id</Form.Label>
-                    <Form.Control
-                        data-testid={testIdPrefix + "-id"}
-                        id="id"
-                        type="text"
-                        {...register("id")}
-                        defaultValue={initialContents?.id}
-                        disabled
-                    />
-                </Form.Group>
-            )}
+            {initialContents || <Form.Group className="mb-3">
+                    <Form.Label htmlFor="id">Application Id</Form.Label>
+                    <Form.Control data-testid={testIdPrefix + "-id"} id="id" type="text" {...register("id")} defaultValue={initialContents?.id} disabled />
+                </Form.Group>}
             {initialContents && (
                 <Form.Group className="mb-3">
killedBy: RiderApplicationEditForm tests handleAction submits data and navigates when approving
statusReason: Error: Objects are not valid as a React child (found: object with keys {id, userId, status, email, created_date, updated_date, cancelled_date, notes, perm_number, description}). If you meant to render a collection of children, use an array instead.

[Survived] OptionalChaining
main/components/RiderApplication/RiderApplicationEditForm.js:79:39
                         id="id"
                         type="text"
                         {...register("id")}
-                        defaultValue={initialContents?.id}
+                        defaultValue={initialContents.id}
                         disabled
                     />

[Killed] LogicalOperator
main/components/RiderApplication/RiderApplicationEditForm.js:84:14
                     />
                 </Form.Group>
             )}
-            {initialContents && (
-                <Form.Group className="mb-3">
-                    <Form.Label htmlFor="userId">Applicant Id</Form.Label>
-                    <Form.Control
-                        data-testid={testIdPrefix + "-userId"}
-                        id="userId"
-                        type="text"
-                        {...register("userId")}
-                        defaultValue={initialContents?.userId}
-                        disabled
-                    />
-                </Form.Group>
-            )}
+            {initialContents || <Form.Group className="mb-3">
+                    <Form.Label htmlFor="userId">Applicant Id</Form.Label>
+                    <Form.Control data-testid={testIdPrefix + "-userId"} id="userId" type="text" {...register("userId")} defaultValue={initialContents?.userId} disabled />
+                </Form.Group>}
             {initialContents && (
                 <Form.Group className="mb-3">
killedBy: RiderApplicationEditPageAdmin tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Objects are not valid as a React child (found: object with keys {id, perm_number, status, email, created_date, updated_date, cancelled_date, description, notes}). If you meant to render a collection of children, use an array instead.

[Survived] ConditionalExpression
main/components/RiderApplication/RiderApplicationEditForm.js:84:14
                     />
                 </Form.Group>
             )}
-            {initialContents && (
-                <Form.Group className="mb-3">
-                    <Form.Label htmlFor="userId">Applicant Id</Form.Label>
-                    <Form.Control
-                        data-testid={testIdPrefix + "-userId"}
-                        id="userId"
-                        type="text"
-                        {...register("userId")}
-                        defaultValue={initialContents?.userId}
-                        disabled
-                    />
-                </Form.Group>
-            )}
+            {false}
             {initialContents && (
                 <Form.Group className="mb-3">

[Survived] StringLiteral
main/components/RiderApplication/RiderApplicationEditForm.js:88:53
                 <Form.Group className="mb-3">
                     <Form.Label htmlFor="userId">Applicant Id</Form.Label>
                     <Form.Control
-                        data-testid={testIdPrefix + "-userId"}
+                        data-testid={testIdPrefix + ""}
                         id="userId"
                         type="text"

[Killed] StringLiteral
main/components/RiderApplication/RiderApplicationEditForm.js:91:38
                         data-testid={testIdPrefix + "-userId"}
                         id="userId"
                         type="text"
-                        {...register("userId")}
+                        {...register("")}
                         defaultValue={initialContents?.userId}
                         disabled
killedBy: RiderApplicationEditPageAdmin tests tests where backend is working normally Is populated with the data provided
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Survived] OptionalChaining
main/components/RiderApplication/RiderApplicationEditForm.js:92:39
                         id="userId"
                         type="text"
                         {...register("userId")}
-                        defaultValue={initialContents?.userId}
+                        defaultValue={initialContents.userId}
                         disabled
                     />

[Killed] ConditionalExpression
main/components/RiderApplication/RiderApplicationEditForm.js:97:14
                     />
                 </Form.Group>
             )}
-            {initialContents && (
-                <Form.Group className="mb-3">
-                    <Form.Label htmlFor="status">Status</Form.Label>
-                    <Form.Control
-                        data-testid={testIdPrefix + "-status"}
-                        id="status"
-                        type="text"
-                        {...register("status")}
-                        defaultValue={initialContents?.status}
-                        disabled
-                    />
-                </Form.Group>
-            )}
+            {true}
             <Form.Group className="mb-3">
                 <Form.Label htmlFor="email">Email</Form.Label>
killedBy: RiderApplicationEditPageAdmin tests tests where backend is working normally Is populated with the data provided
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RiderApplicationEditForm-status"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] LogicalOperator
main/components/RiderApplication/RiderApplicationEditForm.js:97:14
                     />
                 </Form.Group>
             )}
-            {initialContents && (
-                <Form.Group className="mb-3">
-                    <Form.Label htmlFor="status">Status</Form.Label>
-                    <Form.Control
-                        data-testid={testIdPrefix + "-status"}
-                        id="status"
-                        type="text"
-                        {...register("status")}
-                        defaultValue={initialContents?.status}
-                        disabled
-                    />
-                </Form.Group>
-            )}
+            {initialContents || <Form.Group className="mb-3">
+                    <Form.Label htmlFor="status">Status</Form.Label>
+                    <Form.Control data-testid={testIdPrefix + "-status"} id="status" type="text" {...register("status")} defaultValue={initialContents?.status} disabled />
+                </Form.Group>}
             <Form.Group className="mb-3">
                 <Form.Label htmlFor="email">Email</Form.Label>
killedBy: RiderApplicationEditPageAdmin tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Objects are not valid as a React child (found: object with keys {id, perm_number, status, email, created_date, updated_date, cancelled_date, description, notes}). If you meant to render a collection of children, use an array instead.

[Killed] StringLiteral
main/components/RiderApplication/RiderApplicationEditForm.js:101:53
                 <Form.Group className="mb-3">
                     <Form.Label htmlFor="status">Status</Form.Label>
                     <Form.Control
-                        data-testid={testIdPrefix + "-status"}
+                        data-testid={testIdPrefix + ""}
                         id="status"
                         type="text"
killedBy: RiderApplicationEditPageAdmin tests tests where backend is working normally Is populated with the data provided
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RiderApplicationEditForm-status"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Survived] OptionalChaining
main/components/RiderApplication/RiderApplicationEditForm.js:105:39
                         id="status"
                         type="text"
                         {...register("status")}
-                        defaultValue={initialContents?.status}
+                        defaultValue={initialContents.status}
                         disabled
                     />

[Killed] ConditionalExpression
main/components/RiderApplication/RiderApplicationEditForm.js:121:14
                     disabled
                 />
             </Form.Group>
-            {initialContents && (
-                <Form.Group className="mb-3">
-                    <Form.Label htmlFor="created_date">Date Applied</Form.Label>
-                    <Form.Control
-                        data-testid={testIdPrefix + "-created_date"}
-                        id="created_date"
-                        type="text"
-                        {...register("created_date")}
-                        defaultValue={initialContents?.created_date}
-                        disabled
-                    />
-                </Form.Group>
-            )}
+            {false}
             {initialContents && (
                 <Form.Group className="mb-3">
killedBy: RiderApplicationEditPageAdmin tests tests where backend is working normally Is populated with the data provided
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RiderApplicationEditForm-created_date"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] LogicalOperator
main/components/RiderApplication/RiderApplicationEditForm.js:121:14
                     disabled
                 />
             </Form.Group>
-            {initialContents && (
-                <Form.Group className="mb-3">
-                    <Form.Label htmlFor="created_date">Date Applied</Form.Label>
-                    <Form.Control
-                        data-testid={testIdPrefix + "-created_date"}
-                        id="created_date"
-                        type="text"
-                        {...register("created_date")}
-                        defaultValue={initialContents?.created_date}
-                        disabled
-                    />
-                </Form.Group>
-            )}
+            {initialContents || <Form.Group className="mb-3">
+                    <Form.Label htmlFor="created_date">Date Applied</Form.Label>
+                    <Form.Control data-testid={testIdPrefix + "-created_date"} id="created_date" type="text" {...register("created_date")} defaultValue={initialContents?.created_date} disabled />
+                </Form.Group>}
             {initialContents && (
                 <Form.Group className="mb-3">
killedBy: RiderApplicationEditPageAdmin tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Objects are not valid as a React child (found: object with keys {id, perm_number, status, email, created_date, updated_date, cancelled_date, description, notes}). If you meant to render a collection of children, use an array instead.

[Killed] StringLiteral
main/components/RiderApplication/RiderApplicationEditForm.js:125:53
                 <Form.Group className="mb-3">
                     <Form.Label htmlFor="created_date">Date Applied</Form.Label>
                     <Form.Control
-                        data-testid={testIdPrefix + "-created_date"}
+                        data-testid={testIdPrefix + ""}
                         id="created_date"
                         type="text"
killedBy: RiderApplicationEditPageAdmin tests tests where backend is working normally Is populated with the data provided
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RiderApplicationEditForm-created_date"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Survived] OptionalChaining
main/components/RiderApplication/RiderApplicationEditForm.js:129:39
                         id="created_date"
                         type="text"
                         {...register("created_date")}
-                        defaultValue={initialContents?.created_date}
+                        defaultValue={initialContents.created_date}
                         disabled
                     />

[Killed] LogicalOperator
main/components/RiderApplication/RiderApplicationEditForm.js:134:14
                     />
                 </Form.Group>
             )}
-            {initialContents && (
-                <Form.Group className="mb-3">
-                    <Form.Label htmlFor="updated_date">Date Updated</Form.Label>
-                    <Form.Control
-                        data-testid={testIdPrefix + "-updated_date"}
-                        id="updated_date"
-                        type="text"
-                        {...register("updated_date")}
-                        defaultValue={initialContents?.updated_date}
-                        disabled
-                    />
-                </Form.Group>
-            )}
+            {initialContents || <Form.Group className="mb-3">
+                    <Form.Label htmlFor="updated_date">Date Updated</Form.Label>
+                    <Form.Control data-testid={testIdPrefix + "-updated_date"} id="updated_date" type="text" {...register("updated_date")} defaultValue={initialContents?.updated_date} disabled />
+                </Form.Group>}
             {initialContents && (
                 <Form.Group className="mb-3">
killedBy: RiderApplicationEditPageAdmin tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Objects are not valid as a React child (found: object with keys {id, perm_number, status, email, created_date, updated_date, cancelled_date, description, notes}). If you meant to render a collection of children, use an array instead.

[Killed] ConditionalExpression
main/components/RiderApplication/RiderApplicationEditForm.js:134:14
                     />
                 </Form.Group>
             )}
-            {initialContents && (
-                <Form.Group className="mb-3">
-                    <Form.Label htmlFor="updated_date">Date Updated</Form.Label>
-                    <Form.Control
-                        data-testid={testIdPrefix + "-updated_date"}
-                        id="updated_date"
-                        type="text"
-                        {...register("updated_date")}
-                        defaultValue={initialContents?.updated_date}
-                        disabled
-                    />
-                </Form.Group>
-            )}
+            {true}
             {initialContents && (
                 <Form.Group className="mb-3">
killedBy: RiderApplicationEditPageAdmin tests tests where backend is working normally Is populated with the data provided
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RiderApplicationEditForm-updated_date"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Survived] OptionalChaining
main/components/RiderApplication/RiderApplicationEditForm.js:142:39
                         id="updated_date"
                         type="text"
                         {...register("updated_date")}
-                        defaultValue={initialContents?.updated_date}
+                        defaultValue={initialContents.updated_date}
                         disabled
                     />

[Killed] ConditionalExpression
main/components/RiderApplication/RiderApplicationEditForm.js:147:14
                     />
                 </Form.Group>
             )}
-            {initialContents && (
-                <Form.Group className="mb-3">
-                    <Form.Label htmlFor="cancelled_date">Date Cancelled</Form.Label>
-                    <Form.Control
-                        data-testid={testIdPrefix + "-cancelled_date"}
-                        id="cancelled_date"
-                        type="text"
-                        {...register("cancelled_date")}
-                        defaultValue={initialContents?.cancelled_date}
-                        disabled
-                    />
-                </Form.Group>
-            )}
+            {true}
             {initialContents && initialContents.status === 'declined' && (
                 <Form.Group className="mb-3">
killedBy: RiderApplicationEditPageAdmin tests tests where backend is working normally Is populated with the data provided
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RiderApplicationEditForm-cancelled_date"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ConditionalExpression
main/components/RiderApplication/RiderApplicationEditForm.js:147:14
                     />
                 </Form.Group>
             )}
-            {initialContents && (
-                <Form.Group className="mb-3">
-                    <Form.Label htmlFor="cancelled_date">Date Cancelled</Form.Label>
-                    <Form.Control
-                        data-testid={testIdPrefix + "-cancelled_date"}
-                        id="cancelled_date"
-                        type="text"
-                        {...register("cancelled_date")}
-                        defaultValue={initialContents?.cancelled_date}
-                        disabled
-                    />
-                </Form.Group>
-            )}
+            {false}
             {initialContents && initialContents.status === 'declined' && (
                 <Form.Group className="mb-3">
killedBy: RiderApplicationEditPageAdmin tests tests where backend is working normally Is populated with the data provided
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RiderApplicationEditForm-cancelled_date"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] StringLiteral
main/components/RiderApplication/RiderApplicationEditForm.js:151:53
                 <Form.Group className="mb-3">
                     <Form.Label htmlFor="cancelled_date">Date Cancelled</Form.Label>
                     <Form.Control
-                        data-testid={testIdPrefix + "-cancelled_date"}
+                        data-testid={testIdPrefix + ""}
                         id="cancelled_date"
                         type="text"
killedBy: RiderApplicationEditPageAdmin tests tests where backend is working normally Is populated with the data provided
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RiderApplicationEditForm-cancelled_date"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] StringLiteral
main/components/RiderApplication/RiderApplicationEditForm.js:154:38
                         data-testid={testIdPrefix + "-cancelled_date"}
                         id="cancelled_date"
                         type="text"
-                        {...register("cancelled_date")}
+                        {...register("")}
                         defaultValue={initialContents?.cancelled_date}
                         disabled
killedBy: RiderApplicationEditPageAdmin tests tests where backend is working normally Is populated with the data provided
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Survived] OptionalChaining
main/components/RiderApplication/RiderApplicationEditForm.js:155:39
                         id="cancelled_date"
                         type="text"
                         {...register("cancelled_date")}
-                        defaultValue={initialContents?.cancelled_date}
+                        defaultValue={initialContents.cancelled_date}
                         disabled
                     />

[Killed] EqualityOperator
main/components/RiderApplication/RiderApplicationEditForm.js:160:33
                     />
                 </Form.Group>
             )}
-            {initialContents && initialContents.status === 'declined' && (
+            {initialContents && initialContents.status !== 'declined' && (
                 <Form.Group className="mb-3">
                     <Form.Label htmlFor="notes">Notes</Form.Label>
killedBy: RiderApplicationEditPageAdmin tests tests where backend is working normally Is populated with the data provided
statusReason: TestingLibraryElementError: Found multiple elements by: [data-testid="RiderApplicationEditForm-notes"]

Here are the matching elements:

<input
  class="form-control"
  data-testid="RiderApplicationEditForm-notes"
  disabled=""

[Killed] LogicalOperator
main/components/RiderApplication/RiderApplicationEditForm.js:160:14
                     />
                 </Form.Group>
             )}
-            {initialContents && initialContents.status === 'declined' && (
+            {initialContents || initialContents.status === 'declined' && (
                 <Form.Group className="mb-3">
                     <Form.Label htmlFor="notes">Notes</Form.Label>
killedBy: RiderApplicationEditPageAdmin tests tests where backend is working normally Is populated with the data provided
statusReason: TestingLibraryElementError: Found multiple elements by: [data-testid="RiderApplicationEditForm-notes"]

Here are the matching elements:

<input
  class="form-control"
  data-testid="RiderApplicationEditForm-notes"
  disabled=""
