[Survived] OptionalChaining
main/components/RiderApplication/RiderApplicationEditForm.js:168:39
                         id="notes"
                         type="text"
                         {...register("notes")}
-                        defaultValue={initialContents?.notes}
+                        defaultValue={initialContents.notes}
                         disabled
                     />

[Killed] EqualityOperator
main/components/RiderApplication/RiderApplicationEditForm.js:173:33
                     />
                 </Form.Group>
             )}
-            {initialContents && initialContents.status === 'cancelled' && (
+            {initialContents && initialContents.status !== 'cancelled' && (
                 <Form.Group className="mb-3">
                     <Form.Label htmlFor="notes">Notes</Form.Label>
killedBy: RiderApplicationEditPageAdmin tests tests where backend is working normally Is populated with the data provided
statusReason: TestingLibraryElementError: Found multiple elements by: [data-testid="RiderApplicationEditForm-notes"]

Here are the matching elements:

<input
  class="form-control"
  data-testid="RiderApplicationEditForm-notes"
  disabled=""

[Killed] ConditionalExpression
main/components/RiderApplication/RiderApplicationEditForm.js:173:14
                     />
                 </Form.Group>
             )}
-            {initialContents && initialContents.status === 'cancelled' && (
+            {true && (
                 <Form.Group className="mb-3">
                     <Form.Label htmlFor="notes">Notes</Form.Label>
killedBy: RiderApplicationEditPageAdmin tests tests where backend is working normally Is populated with the data provided
statusReason: TestingLibraryElementError: Found multiple elements by: [data-testid="RiderApplicationEditForm-notes"]

Here are the matching elements:

<input
  class="form-control"
  data-testid="RiderApplicationEditForm-notes"
  disabled=""

[Killed] EqualityOperator
main/components/RiderApplication/RiderApplicationEditForm.js:186:33
                     />
                 </Form.Group>
             )}
-            {initialContents && initialContents.status === 'expired' && (
+            {initialContents && initialContents.status !== 'expired' && (
                 <Form.Group className="mb-3">
                     <Form.Label htmlFor="notes">Notes</Form.Label>
killedBy: RiderApplicationEditPageAdmin tests tests where backend is working normally Is populated with the data provided
statusReason: TestingLibraryElementError: Found multiple elements by: [data-testid="RiderApplicationEditForm-notes"]

Here are the matching elements:

<input
  class="form-control"
  data-testid="RiderApplicationEditForm-notes"
  disabled=""

[Killed] ConditionalExpression
main/components/RiderApplication/RiderApplicationEditForm.js:186:14
                     />
                 </Form.Group>
             )}
-            {initialContents && initialContents.status === 'expired' && (
+            {true && (
                 <Form.Group className="mb-3">
                     <Form.Label htmlFor="notes">Notes</Form.Label>
killedBy: RiderApplicationEditPageAdmin tests tests where backend is working normally Is populated with the data provided
statusReason: TestingLibraryElementError: Found multiple elements by: [data-testid="RiderApplicationEditForm-notes"]

Here are the matching elements:

<input
  class="form-control"
  data-testid="RiderApplicationEditForm-notes"
  disabled=""

[Killed] StringLiteral
main/components/RiderApplication/RiderApplicationEditForm.js:193:38
                         data-testid={testIdPrefix + "-notes"}
                         id="notes"
                         type="text"
-                        {...register("notes")}
+                        {...register("")}
                         defaultValue={initialContents?.notes}
                         disabled
killedBy: RiderApplicationEditForm tests renders correctly when passing in initialContents with status expired
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] ConditionalExpression
main/components/RiderApplication/RiderApplicationEditForm.js:199:14
                     />
                 </Form.Group>
             )}
-            {initialContents && initialContents.status !== 'declined' && initialContents.status !== 'cancelled' && initialContents.status !== 'expired' && (
-                <Form.Group className="mb-3">
-                    <Form.Label htmlFor="notes">Notes</Form.Label>
-                    <Form.Control
-                        data-testid={testIdPrefix + "-notes"}
-                        id="notes"
-                        type="text"
-                        {...register("notes")}
-                        defaultValue={initialContents?.notes}
-                    />
-                </Form.Group>
-            )}
+            {true}
             {initialContents && (
                 <Form.Group className="mb-3">
killedBy: RiderApplicationEditPageAdmin tests tests where backend is working normally Is populated with the data provided
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RiderApplicationEditForm-notes"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ConditionalExpression
main/components/RiderApplication/RiderApplicationEditForm.js:199:14
                     />
                 </Form.Group>
             )}
-            {initialContents && initialContents.status !== 'declined' && initialContents.status !== 'cancelled' && initialContents.status !== 'expired' && (
+            {true && initialContents.status !== 'expired' && (
                 <Form.Group className="mb-3">
                     <Form.Label htmlFor="notes">Notes</Form.Label>
killedBy: RiderApplicationEditForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading 'status')

[Killed] ConditionalExpression
main/components/RiderApplication/RiderApplicationEditForm.js:211:14
                     />
                 </Form.Group>
             )}
-            {initialContents && (
-                <Form.Group className="mb-3">
-                    <Form.Label htmlFor="perm_number">Perm Number</Form.Label>
-                    <Form.Control
-                        data-testid={testIdPrefix + "-perm_number"}
-                        id="perm_number"
-                        type="text"
-                        {...register("perm_number")}
-                        defaultValue={initialContents?.perm_number}
-                        disabled
-                    />
-                </Form.Group>
-            )}
+            {false}
             <Form.Group className="mb-3">
                 <Form.Label htmlFor="description">Description</Form.Label>
killedBy: RiderApplicationEditPageAdmin tests tests where backend is working normally Is populated with the data provided
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RiderApplicationEditForm-perm_number"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ConditionalExpression
main/components/RiderApplication/RiderApplicationEditForm.js:211:14
                     />
                 </Form.Group>
             )}
-            {initialContents && (
-                <Form.Group className="mb-3">
-                    <Form.Label htmlFor="perm_number">Perm Number</Form.Label>
-                    <Form.Control
-                        data-testid={testIdPrefix + "-perm_number"}
-                        id="perm_number"
-                        type="text"
-                        {...register("perm_number")}
-                        defaultValue={initialContents?.perm_number}
-                        disabled
-                    />
-                </Form.Group>
-            )}
+            {true}
             <Form.Group className="mb-3">
                 <Form.Label htmlFor="description">Description</Form.Label>
killedBy: RiderApplicationEditPageAdmin tests tests where backend is working normally Is populated with the data provided
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RiderApplicationEditForm-perm_number"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] StringLiteral
main/components/RiderApplication/RiderApplicationEditForm.js:215:53
                 <Form.Group className="mb-3">
                     <Form.Label htmlFor="perm_number">Perm Number</Form.Label>
                     <Form.Control
-                        data-testid={testIdPrefix + "-perm_number"}
+                        data-testid={testIdPrefix + ""}
                         id="perm_number"
                         type="text"
killedBy: RiderApplicationEditPageAdmin tests tests where backend is working normally Is populated with the data provided
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RiderApplicationEditForm-perm_number"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Survived] OptionalChaining
main/components/RiderApplication/RiderApplicationEditForm.js:219:39
                         id="perm_number"
                         type="text"
                         {...register("perm_number")}
-                        defaultValue={initialContents?.perm_number}
+                        defaultValue={initialContents.perm_number}
                         disabled
                     />

[Killed] StringLiteral
main/components/RiderApplication/RiderApplicationEditForm.js:232:34
                     id="description"
                     as="textarea"
                     isInvalid={Boolean(errors.description)}
-                    {...register("description")}
+                    {...register("")}
                     defaultValue={initialContents?.description}
                     disabled
killedBy: RiderApplicationEditPageAdmin tests tests where backend is working normally Is populated with the data provided
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] OptionalChaining
main/components/RiderApplication/RiderApplicationEditForm.js:233:35
                     as="textarea"
                     isInvalid={Boolean(errors.description)}
                     {...register("description")}
-                    defaultValue={initialContents?.description}
+                    defaultValue={initialContents.description}
                     disabled
                     style={{ width: '100%', minHeight: '10rem', resize: 'vertical', verticalAlign: 'top' }}
killedBy: RiderApplicationEditForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading 'description')

[Survived] ObjectLiteral
main/components/RiderApplication/RiderApplicationEditForm.js:235:28
                     {...register("description")}
                     defaultValue={initialContents?.description}
                     disabled
-                    style={{ width: '100%', minHeight: '10rem', resize: 'vertical', verticalAlign: 'top' }}
+                    style={{}}
                 />
             </Form.Group>

[Survived] StringLiteral
main/components/RiderApplication/RiderApplicationEditForm.js:235:56
                     {...register("description")}
                     defaultValue={initialContents?.description}
                     disabled
-                    style={{ width: '100%', minHeight: '10rem', resize: 'vertical', verticalAlign: 'top' }}
+                    style={{ width: '100%', minHeight: "", resize: 'vertical', verticalAlign: 'top' }}
                 />
             </Form.Group>

[Killed] ConditionalExpression
main/components/RiderApplication/RiderApplicationEditForm.js:238:14
                     style={{ width: '100%', minHeight: '10rem', resize: 'vertical', verticalAlign: 'top' }}
                 />
             </Form.Group>
-            {initialContents && initialContents.status === 'pending' && (
-                <Button
-                    variant="success"
-                    onClick={handleApprove}
-                    data-testid={testIdPrefix + "-approve"}
-                >
-                    Approve
-                </Button>
-            )}
+            {false}
             {initialContents && initialContents.status === 'pending' && (
                 <Button
killedBy: RiderApplicationEditForm tests handleAction submits data and navigates when approving
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RiderApplicationEditForm-approve"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] EqualityOperator
main/components/RiderApplication/RiderApplicationEditForm.js:238:33
                     style={{ width: '100%', minHeight: '10rem', resize: 'vertical', verticalAlign: 'top' }}
                 />
             </Form.Group>
-            {initialContents && initialContents.status === 'pending' && (
+            {initialContents && initialContents.status !== 'pending' && (
                 <Button
                     variant="success"
killedBy: RiderApplicationEditForm tests handleAction submits data and navigates when approving
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RiderApplicationEditForm-approve"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] EqualityOperator
main/components/RiderApplication/RiderApplicationEditForm.js:247:33
                     Approve
                 </Button>
             )}
-            {initialContents && initialContents.status === 'pending' && (
+            {initialContents && initialContents.status !== 'pending' && (
                 <Button
                     variant="danger"
killedBy: RiderApplicationEditForm tests handleAction submits data and navigates when denying
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RiderApplicationEditForm-deny"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/RiderApplication/RiderApplicationEditForm.js:247:14
                     Approve
                 </Button>
             )}
-            {initialContents && initialContents.status === 'pending' && (
-                <Button
-                    variant="danger"
-                    onClick={handleDeny}
-                    data-testid={testIdPrefix + "-deny"}
-                >
-                    Deny
-                </Button>
-            )}
+            {initialContents && initialContents.status === 'pending' || <Button variant="danger" onClick={handleDeny} data-testid={testIdPrefix + "-deny"}>
+                    Deny
+                </Button>}
             {initialContents && initialContents.status === 'pending' && (
                 <Button
killedBy: RiderApplicationEditForm tests handleAction submits data and navigates when denying
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RiderApplicationEditForm-deny"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/RiderApplication/RiderApplicationEditForm.js:251:49
                 <Button
                     variant="danger"
                     onClick={handleDeny}
-                    data-testid={testIdPrefix + "-deny"}
+                    data-testid={testIdPrefix + ""}
                 >
                     Deny
killedBy: RiderApplicationEditForm tests handleAction submits data and navigates when denying
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RiderApplicationEditForm-deny"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/RiderApplication/RiderApplicationEditForm.js:256:14
                     Deny
                 </Button>
             )}
-            {initialContents && initialContents.status === 'pending' && (
-                <Button
-                    type="submit"
-                    data-testid={testIdPrefix + "-submit"}
-                >
-                    Save
-                </Button>
-            )}
+            {true}
             {initialContents && initialContents.status === 'accepted' && (
                 <Button
killedBy: RiderApplicationEditPageAdmin tests tests where backend is working normally Changes when you click Update
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RiderApplicationEditForm-submit"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ConditionalExpression
main/components/RiderApplication/RiderApplicationEditForm.js:256:14
                     Deny
                 </Button>
             )}
-            {initialContents && initialContents.status === 'pending' && (
-                <Button
-                    type="submit"
-                    data-testid={testIdPrefix + "-submit"}
-                >
-                    Save
-                </Button>
-            )}
+            {false}
             {initialContents && initialContents.status === 'accepted' && (
                 <Button
killedBy: RiderApplicationEditPageAdmin tests tests where backend is working normally Changes when you click Update
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RiderApplicationEditForm-submit"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] EqualityOperator
main/components/RiderApplication/RiderApplicationEditForm.js:264:33
                     Save
                 </Button>
             )}
-            {initialContents && initialContents.status === 'accepted' && (
+            {initialContents && initialContents.status !== 'accepted' && (
                 <Button
                     variant="danger"
killedBy: RiderApplicationEditForm tests handleAction submits data and navigates when expiring
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RiderApplicationEditForm-expire"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/RiderApplication/RiderApplicationEditForm.js:264:14
                     Save
                 </Button>
             )}
-            {initialContents && initialContents.status === 'accepted' && (
-                <Button
-                    variant="danger"
-                    onClick={handleExpired}
-                    data-testid={testIdPrefix + "-expire"}
-                >
-                    Set Status to Expired
-                </Button>
-            )}
+            {true}
             <Button
                 variant="secondary"
killedBy: RiderApplicationEditForm tests handleAction submits data and navigates when expiring
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RiderApplicationEditForm-expire"]

<body>
  <div>
    <form
      class=""
    >
      <div
