[Killed] BlockStatement
main/components/Ride/RideTable.js:16:36
 
     const navigate = useNavigate();
 
-    const editCallback = (cell) => {
-        navigate(`/ride/edit/${cell.row.values.id}`)
-    }
+    const editCallback = (cell) => {}
 
     const assignCallback = (cell) => {
killedBy: RideTable tests Edit button navigates to the edit page for admin user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/ride/edit/2"

Number of calls: 0

<html>
  <head />

[Killed] StringLiteral
main/components/Ride/RideTable.js:17:18
     const navigate = useNavigate();
 
     const editCallback = (cell) => {
-        navigate(`/ride/edit/${cell.row.values.id}`)
+        navigate(``)
     }
 
killedBy: RideTable tests Edit button navigates to the edit page for admin user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/ride/edit/2"
Received: ""

Number of calls: 1

<html>

[Killed] BlockStatement
main/components/Ride/RideTable.js:20:38
         navigate(`/ride/edit/${cell.row.values.id}`)
     }
 
-    const assignCallback = (cell) => {
-        navigate(`/ride/assigndriver/${cell.row.values.id}`)
-    }
+    const assignCallback = (cell) => {}
 
     // Stryker disable all : hard to test for query caching
killedBy: RideTable tests Assign driver button navigates to the assign driver page for admin user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/ride/assigndriver/2"

Number of calls: 0

<html>
  <head />

[Killed] StringLiteral
main/components/Ride/RideTable.js:47:21
             accessor: 'day',
         },
         {
-            Header: 'Student',
+            Header: "",
             accessor: 'student',
         },
killedBy: RideTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element with the text: Student. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] ArrowFunction
main/components/Ride/RideTable.js:53:19
         {
             Header: 'Shift',
             accessor: 'shiftId',
-            Cell: ({ value }) => (
-                // Stryker disable next-line all : hard to set up test
-                <Link to={`/shiftInfo/${value}`}>{value}</Link>
-              ),
+            Cell: () => undefined,
         },
         {
killedBy: RideRequestIndexPage tests renders three rides without crashing for admin user
statusReason: Error: Component(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] StringLiteral
main/components/Ride/RideTable.js:64:23
         },
         {
             Header: 'Pick Up Time',
-            accessor: 'startTime',
+            accessor: "",
         },
         {
killedBy: RideTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RideTable-cell-row-0-col-startTime"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] ObjectLiteral
main/components/Ride/RideTable.js:66:9
             Header: 'Pick Up Time',
             accessor: 'startTime',
         },
-        {
-            Header: 'Drop Off Time',
-            accessor: 'endTime',
-        },
+        {},
         {
             Header: 'Pick Up Building',
killedBy: RideRequestIndexPage tests renders three rides without crashing for admin user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Ride/RideTable.js:68:23
         },
         {
             Header: 'Drop Off Time',
-            accessor: 'endTime',
+            accessor: "",
         },
         {
killedBy: RideTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RideTable-cell-row-0-col-endTime"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] ObjectLiteral
main/components/Ride/RideTable.js:70:9
             Header: 'Drop Off Time',
             accessor: 'endTime',
         },
-        {
-            Header: 'Pick Up Building',
-            accessor: 'pickupBuilding',
-        },
+        {},
         {
             Header: 'Pick Up Room',
killedBy: RideRequestIndexPage tests renders three rides without crashing for admin user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Ride/RideTable.js:71:21
             accessor: 'endTime',
         },
         {
-            Header: 'Pick Up Building',
+            Header: "",
             accessor: 'pickupBuilding',
         },
killedBy: RideTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element with the text: Pick Up Building. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/Ride/RideTable.js:72:23
         },
         {
             Header: 'Pick Up Building',
-            accessor: 'pickupBuilding',
+            accessor: "",
         },
         {
killedBy: RideTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RideTable-cell-row-0-col-pickupBuilding"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] ObjectLiteral
main/components/Ride/RideTable.js:74:9
             Header: 'Pick Up Building',
             accessor: 'pickupBuilding',
         },
-        {
-            Header: 'Pick Up Room',
-            accessor: 'pickupRoom',
-        },
+        {},
         {
             Header: 'Drop Off Building',
killedBy: RideRequestIndexPage tests renders three rides without crashing for admin user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Ride/RideTable.js:75:21
             accessor: 'pickupBuilding',
         },
         {
-            Header: 'Pick Up Room',
+            Header: "",
             accessor: 'pickupRoom',
         },
killedBy: RideTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element with the text: Pick Up Room. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/Ride/RideTable.js:76:23
         },
         {
             Header: 'Pick Up Room',
-            accessor: 'pickupRoom',
+            accessor: "",
         },
         {
killedBy: RideTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RideTable-cell-row-0-col-pickupRoom"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/Ride/RideTable.js:83:21
             accessor: 'dropoffBuilding',
         },
         {
-            Header: 'Drop Off Room',
+            Header: "",
             accessor: 'dropoffRoom',
         },
killedBy: RideTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element with the text: Drop Off Room. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/Ride/RideTable.js:84:23
         },
         {
             Header: 'Drop Off Room',
-            accessor: 'dropoffRoom',
+            accessor: "",
         },
         {
killedBy: RideTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RideTable-cell-row-0-col-dropoffRoom"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] ObjectLiteral
main/components/Ride/RideTable.js:93:9
     ];
 
     const columnsDriver = [
-        {
-            Header: 'id',
-            accessor: 'id', // accessor is the "key" in the data
-        },
+        {},
         {
             Header: 'Day',
killedBy: RideTable tests renders without crashing for empty table for driver
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Ride/RideTable.js:106:21
             accessor: 'student',
         },
         {
-            Header: 'Shift',
+            Header: "",
             accessor: 'shiftId',
             Cell: ({ value }) => (
killedBy: RideTable tests Has the expected column headers and content for ordinary driver
statusReason: TestingLibraryElementError: Unable to find an element with the text: Shift. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] ObjectLiteral
main/components/Ride/RideTable.js:117:9
             Header: 'Course #',
             accessor: 'course',
         },
-        {
-            Header: 'Pick Up Time',
-            accessor: 'startTime',
-        },
+        {},
         {
             Header: 'Drop Off Time',
killedBy: RideRequestIndexPage tests renders three rides without crashing for admin user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Ride/RideTable.js:122:21
             accessor: 'startTime',
         },
         {
-            Header: 'Drop Off Time',
+            Header: "",
             accessor: 'endTime',
         },
killedBy: RideTable tests Has the expected column headers and content for ordinary driver
statusReason: TestingLibraryElementError: Unable to find an element with the text: Drop Off Time. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/Ride/RideTable.js:134:21
             accessor: 'pickupRoom',
         },
         {
-            Header: 'Drop Off Building',
+            Header: "",
             accessor: 'dropoffBuilding',
         },
killedBy: RideTable tests Has the expected column headers and content for ordinary driver
statusReason: TestingLibraryElementError: Unable to find an element with the text: Drop Off Building. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] ObjectLiteral
main/components/Ride/RideTable.js:141:9
             Header: 'Drop Off Room',
             accessor: 'dropoffRoom',
         },
-        {
-            Header: 'Notes',
-            accessor: 'notes',
-        }
+        {}
     ];
 
killedBy: RideRequestIndexPage tests renders three rides without crashing for admin user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] EqualityOperator
main/components/Ride/RideTable.js:191:35
         {
             Header: 'Assigned Status',
             accessor: 'shiftId',
-            Cell: ({ value }) => (value === 0 ? 'Unassigned' : 'Assigned')
+            Cell: ({ value }) => (value !== 0 ? 'Unassigned' : 'Assigned')
         }
     ];
killedBy: RideTable tests Has the expected column headers and content for ordinary rider
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  /^Assigned$/
Received:
  Unassigned

[Killed] ArrowFunction
main/components/Ride/RideTable.js:191:19
         {
             Header: 'Assigned Status',
             accessor: 'shiftId',
-            Cell: ({ value }) => (value === 0 ? 'Unassigned' : 'Assigned')
+            Cell: () => undefined
         }
     ];
killedBy: RideTable tests Has the expected column headers and content for ordinary rider
statusReason: Error: Component(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] StringLiteral
main/components/Ride/RideTable.js:198:55
 
     const buttonColumnsRider = [
         ...columnsRider,
-        ButtonColumn("Edit", "primary", editCallback, "RideTable"),
+        ButtonColumn("Edit", "primary", editCallback, ""),
         ButtonColumn("Delete", "danger", deleteCallback, "RideTable")
     ]
killedBy: RideTable tests Has the expected column headers and content for ordinary rider
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RideTable-cell-row-0-col-Edit-button"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/Ride/RideTable.js:205:58
     const buttonColumnsAdmin = [
         ...columns,
         ButtonColumn("Edit", "primary", editCallback, "RideTable"),
-        ButtonColumn("Delete", "danger", deleteCallback, "RideTable"),
+        ButtonColumn("Delete", "danger", deleteCallback, ""),
         ButtonColumn("Assign Driver", "success", assignCallback, "RideTable")
     ]
killedBy: RideTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RideTable-cell-row-0-col-Delete-button"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/Ride/RideTable.js:206:66
         ...columns,
         ButtonColumn("Edit", "primary", editCallback, "RideTable"),
         ButtonColumn("Delete", "danger", deleteCallback, "RideTable"),
-        ButtonColumn("Assign Driver", "success", assignCallback, "RideTable")
+        ButtonColumn("Assign Driver", "success", assignCallback, "")
     ]
 
killedBy: RideTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RideTable-cell-row-0-col-Assign Driver-button"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/Ride/RideTable.js:206:22
         ...columns,
         ButtonColumn("Edit", "primary", editCallback, "RideTable"),
         ButtonColumn("Delete", "danger", deleteCallback, "RideTable"),
-        ButtonColumn("Assign Driver", "success", assignCallback, "RideTable")
+        ButtonColumn("", "success", assignCallback, "RideTable")
     ]
 
killedBy: RideRequestIndexPage tests renders three rides without crashing for admin user
statusReason: Error: A column ID (or string accessor) is required!
