[Survived] BlockStatement
main/components/Shift/ShiftForm.js:19:21
 
     const [drivers, setDrivers] = useState([]);
 
-    useEffect(() => {
-        async function fetchDrivers() {
-            try {
-                const response = await fetch('/api/drivers/all');
-                if (!response.ok) {
-                    throw new Error('Failed to fetch drivers');
-                }
-                const data = await response.json();
-                setDrivers(data);
-            } catch (error) {
-                console.error('Error fetching drivers:', error);
-            }
-        }
-
-        fetchDrivers();
-    }, []);
+    useEffect(() => {}, []);
 
     return (

[Survived] BlockStatement
main/components/Shift/ShiftForm.js:20:39
     const [drivers, setDrivers] = useState([]);
 
     useEffect(() => {
-        async function fetchDrivers() {
-            try {
-                const response = await fetch('/api/drivers/all');
-                if (!response.ok) {
-                    throw new Error('Failed to fetch drivers');
-                }
-                const data = await response.json();
-                setDrivers(data);
-            } catch (error) {
-                console.error('Error fetching drivers:', error);
-            }
-        }
+        async function fetchDrivers() {}
 
         fetchDrivers();

[Survived] BlockStatement
main/components/Shift/ShiftForm.js:21:17
 
     useEffect(() => {
         async function fetchDrivers() {
-            try {
-                const response = await fetch('/api/drivers/all');
-                if (!response.ok) {
-                    throw new Error('Failed to fetch drivers');
-                }
-                const data = await response.json();
-                setDrivers(data);
-            } catch (error) {
+            try {} catch (error) {
                 console.error('Error fetching drivers:', error);
             }

[Survived] ConditionalExpression
main/components/Shift/ShiftForm.js:23:21
         async function fetchDrivers() {
             try {
                 const response = await fetch('/api/drivers/all');
-                if (!response.ok) {
+                if (false) {
                     throw new Error('Failed to fetch drivers');
                 }

[Survived] ConditionalExpression
main/components/Shift/ShiftForm.js:23:21
         async function fetchDrivers() {
             try {
                 const response = await fetch('/api/drivers/all');
-                if (!response.ok) {
+                if (true) {
                     throw new Error('Failed to fetch drivers');
                 }

[Survived] BlockStatement
main/components/Shift/ShiftForm.js:28:29
                 }
                 const data = await response.json();
                 setDrivers(data);
-            } catch (error) {
-                console.error('Error fetching drivers:', error);
-            }
+            } catch (error) {}
         }
 

[Survived] StringLiteral
main/components/Shift/ShiftForm.js:29:31
                 const data = await response.json();
                 setDrivers(data);
             } catch (error) {
-                console.error('Error fetching drivers:', error);
+                console.error("", error);
             }
         }

[Killed] ConditionalExpression
main/components/Shift/ShiftForm.js:39:14
     return (
         <Form onSubmit={handleSubmit(submitAction)}>
 
-            {initialContents && (
-                <Form.Group className="mb-3">
-                    <Form.Label htmlFor="id">Id</Form.Label>
-                    <Form.Control
-                        data-testid={testIdPrefix + "-id"}
-                        id="id"
-                        name="id"
-                        type="text"
-                        {...register("id")}
-                        value={initialContents.id}
-                        disabled
-                    />
-                </Form.Group>
-            )}
+            {false}
 
             <Form.Group className="mb-3">
killedBy: ShiftForm tests renders correctly when passing in initialContents
statusReason: Error: Unable to find an element by: [data-testid="ShiftForm-id"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/Shift/ShiftForm.js:39:14
     return (
         <Form onSubmit={handleSubmit(submitAction)}>
 
-            {initialContents && (
-                <Form.Group className="mb-3">
-                    <Form.Label htmlFor="id">Id</Form.Label>
-                    <Form.Control
-                        data-testid={testIdPrefix + "-id"}
-                        id="id"
-                        name="id"
-                        type="text"
-                        {...register("id")}
-                        value={initialContents.id}
-                        disabled
-                    />
-                </Form.Group>
-            )}
+            {initialContents || <Form.Group className="mb-3">
+                    <Form.Label htmlFor="id">Id</Form.Label>
+                    <Form.Control data-testid={testIdPrefix + "-id"} id="id" name="id" type="text" {...register("id")} value={initialContents.id} disabled />
+                </Form.Group>}
 
             <Form.Group className="mb-3">
killedBy: ShiftForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] StringLiteral
main/components/Shift/ShiftForm.js:62:34
                     id="day"
                     name="day"
                     isInvalid={Boolean(errors.day)}
-                    {...register("day", {
+                    {...register("", {
                         required: "Day is required."
                     })}
killedBy: ShiftForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] ObjectLiteral
main/components/Shift/ShiftForm.js:62:41
                     id="day"
                     name="day"
                     isInvalid={Boolean(errors.day)}
-                    {...register("day", {
-                        required: "Day is required."
-                    })}
+                    {...register("day", {})}
                 >
                     <option value="">Select a day</option>
killedBy: ShiftForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Day is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/Shift/ShiftForm.js:83:49
             <Form.Group className="mb-3">
                 <Form.Label htmlFor="shiftStart">Shift Start</Form.Label>
                 <Form.Control
-                    data-testid={testIdPrefix + "-shiftStart"}
+                    data-testid={testIdPrefix + ""}
                     id="shiftStart"
                     name="shiftStart"
killedBy: ShiftForm tests renders data-testid attributes
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="ShiftForm-shiftStart"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/Shift/ShiftForm.js:89:34
                     type="text"
                     placeholder="HH:MMAM/PM e.g. 11:00AM"
                     isInvalid={Boolean(errors.shiftStart)}
-                    {...register("shiftStart", {
+                    {...register("", {
                         required: "Shift start time is required.",
                         pattern: {
killedBy: ShiftForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] Regex
main/components/Shift/ShiftForm.js:92:36
                     {...register("shiftStart", {
                         required: "Shift start time is required.",
                         pattern: {
-                            value: /^(0[0-9]|1[0-2]):[0-5][0-9](AM|PM)$/,
+                            value: /(0[0-9]|1[0-2]):[0-5][0-9](AM|PM)$/,
                             message: "Invalid time format."
                         }
killedBy: ShiftForm tests validates specific time format anomalies
statusReason: Error: Unable to find an element with the text: /Invalid time format./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] Regex
main/components/Shift/ShiftForm.js:92:36
                     {...register("shiftStart", {
                         required: "Shift start time is required.",
                         pattern: {
-                            value: /^(0[0-9]|1[0-2]):[0-5][0-9](AM|PM)$/,
+                            value: /^(0[0-9]|1[0-2]):[0-5][0-9](AM|PM)/,
                             message: "Invalid time format."
                         }
killedBy: ShiftForm tests validates time format with extra characters
statusReason: Error: Unable to find an element with the text: /Invalid time format./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] OptionalChaining
main/components/Shift/ShiftForm.js:98:22
                     })}
                 />
                 <Form.Control.Feedback type="invalid">
-                    {errors.shiftStart?.message}
+                    {errors.shiftStart.message}
                 </Form.Control.Feedback>
             </Form.Group>
killedBy: ShiftForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading 'message')

[Killed] StringLiteral
main/components/Shift/ShiftForm.js:111:34
                     type="text"
                     placeholder="HH:MMAM/PM e.g. 01:37PM"
                     isInvalid={Boolean(errors.shiftEnd)}
-                    {...register("shiftEnd", {
+                    {...register("", {
                         required: "Shift end time is required.",
                         pattern: {
killedBy: ShiftForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Timeout] ObjectLiteral
main/components/Shift/ShiftForm.js:111:46
                     type="text"
                     placeholder="HH:MMAM/PM e.g. 01:37PM"
                     isInvalid={Boolean(errors.shiftEnd)}
-                    {...register("shiftEnd", {
-                        required: "Shift end time is required.",
-                        pattern: {
-                            value: /^(0[0-9]|1[0-2]):[0-5][0-9](AM|PM)$/,
-                            message: "Invalid time format."
-                        }
-                    })}
+                    {...register("shiftEnd", {})}
                 />
                 <Form.Control.Feedback type="invalid">

[Killed] OptionalChaining
main/components/Shift/ShiftForm.js:120:22
                     })}
                 />
                 <Form.Control.Feedback type="invalid">
-                    {errors.shiftEnd?.message}
+                    {errors.shiftEnd.message}
                 </Form.Control.Feedback>
             </Form.Group>
killedBy: ShiftForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading 'message')

[Killed] StringLiteral
main/components/Shift/ShiftForm.js:128:49
                 <Form.Label htmlFor="driverID">Driver ID</Form.Label>
                 <Form.Control
                     as="select"
-                    data-testid={testIdPrefix + "-driverID"}
+                    data-testid={testIdPrefix + ""}
                     id="driverID"
                     name="driverID"
killedBy: ShiftForm tests renders data-testid attributes
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="ShiftForm-driverID"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/Shift/ShiftForm.js:132:34
                     id="driverID"
                     name="driverID"
                     isInvalid={Boolean(errors.driverID)}
-                    {...register("driverID", {
+                    {...register("", {
                         required: "Driver ID is required."
                     })}
killedBy: ShiftForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] StringLiteral
main/components/Shift/ShiftForm.js:133:35
                     name="driverID"
                     isInvalid={Boolean(errors.driverID)}
                     {...register("driverID", {
-                        required: "Driver ID is required."
+                        required: ""
                     })}
                 >
killedBy: ShiftForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Driver ID is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Survived] ArrowFunction
main/components/Shift/ShiftForm.js:137:34
                     })}
                 >
                     <option value="">Select a driver</option>
-                    {drivers.map(driver => (
-                        <option key={driver.id} value={driver.id}>{driver.id} - {driver.givenName} {driver.familyName}</option>
-                    ))}
+                    {drivers.map(() => undefined)}
                 </Form.Control>
                 <Form.Control.Feedback type="invalid">

[Killed] OptionalChaining
main/components/Shift/ShiftForm.js:142:22
                     ))}
                 </Form.Control>
                 <Form.Control.Feedback type="invalid">
-                    {errors.driverID?.message}
+                    {errors.driverID.message}
                 </Form.Control.Feedback>
             </Form.Group>
killedBy: ShiftForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading 'message')

[Killed] StringLiteral
main/components/Shift/ShiftForm.js:150:49
                 <Form.Label htmlFor="driverBackupID">Driver Backup ID</Form.Label>
                 <Form.Control
                     as="select"
-                    data-testid={testIdPrefix + "-driverBackupID"}
+                    data-testid={testIdPrefix + ""}
                     id="driverBackupID"
                     name="driverBackupID"
killedBy: ShiftForm tests renders data-testid attributes
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="ShiftForm-driverBackupID"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/Shift/ShiftForm.js:154:52
                     id="driverBackupID"
                     name="driverBackupID"
                     isInvalid={Boolean(errors.driverBackupID)}
-                    {...register("driverBackupID", {
-                        required: "Driver Backup ID is required."
-                    })}
+                    {...register("driverBackupID", {})}
                 >
                     <option value="">Select a backup driver</option>
killedBy: ShiftForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Driver Backup ID is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/Shift/ShiftForm.js:154:34
                     id="driverBackupID"
                     name="driverBackupID"
                     isInvalid={Boolean(errors.driverBackupID)}
-                    {...register("driverBackupID", {
+                    {...register("", {
                         required: "Driver Backup ID is required."
                     })}
killedBy: ShiftForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] StringLiteral
main/components/Shift/ShiftForm.js:155:35
                     name="driverBackupID"
                     isInvalid={Boolean(errors.driverBackupID)}
                     {...register("driverBackupID", {
-                        required: "Driver Backup ID is required."
+                        required: ""
                     })}
                 >
killedBy: ShiftForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Driver Backup ID is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Survived] ArrowFunction
main/components/Shift/ShiftForm.js:159:34
                     })}
                 >
                     <option value="">Select a backup driver</option>
-                    {drivers.map(driver => (
-                        <option key={driver.id} value={driver.id}>{driver.id} - {driver.givenName} {driver.familyName}</option>
-                    ))}
+                    {drivers.map(() => undefined)}
                 </Form.Control>
                 <Form.Control.Feedback type="invalid">

[Killed] OptionalChaining
main/components/Shift/ShiftForm.js:164:22
                     ))}
                 </Form.Control>
                 <Form.Control.Feedback type="invalid">
-                    {errors.driverBackupID?.message}
+                    {errors.driverBackupID.message}
                 </Form.Control.Feedback>
             </Form.Group>
killedBy: ShiftForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading 'message')
