[Killed] ObjectLiteral
src/main/pages/DriverInfoPage.js:16:9
       useBackend(
         // Stryker disable next-line all : don't test internal caching of React Query
         [`/api/drivers/get?id=${id}`],
-        {  // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
-          method: "GET",
-          url: `/api/drivers/get`,
-          // Stryker disable all
-          params: {
-            id
-          }
-          // Stryker restore all
-        }
+        {}
       );
 
killedBy: DriverInfoPage tests on submit, not driver
statusReason: Error: Unable to find an element with the text: Searched user was not a driver. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
