[Killed] ConditionalExpression
main/components/Driver/DriverAvailabilityForm.js:20:14
     const testIdPrefix = "DriverAvailabilityForm";
     return (
         <Form onSubmit={handleSubmit(submitAction)}>
-            {initialContents && (
-                <Form.Group className="mb-3" >
-                    <Form.Label htmlFor="id">ID</Form.Label>
-                    <Form.Control
-                        data-testid={testIdPrefix + "-id"}
-                        id="id"
-                        type="text"
-                        {...register("id")}
-                        value={initialContents.id}
-                        disabled
-                    />
-                </Form.Group>
-            )}
+            {true}
             <Form.Group className="mb-3" >
                 <Form.Label htmlFor="driverId">Driver ID</Form.Label>
killedBy: DriverAvailabilityForm tests renders correctly when passing in initialContents
statusReason: Error: Unable to find an element by: [data-testid="DriverAvailabilityForm-id"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/Driver/DriverAvailabilityForm.js:20:14
     const testIdPrefix = "DriverAvailabilityForm";
     return (
         <Form onSubmit={handleSubmit(submitAction)}>
-            {initialContents && (
-                <Form.Group className="mb-3" >
-                    <Form.Label htmlFor="id">ID</Form.Label>
-                    <Form.Control
-                        data-testid={testIdPrefix + "-id"}
-                        id="id"
-                        type="text"
-                        {...register("id")}
-                        value={initialContents.id}
-                        disabled
-                    />
-                </Form.Group>
-            )}
+            {initialContents || <Form.Group className="mb-3">
+                    <Form.Label htmlFor="id">ID</Form.Label>
+                    <Form.Control data-testid={testIdPrefix + "-id"} id="id" type="text" {...register("id")} value={initialContents.id} disabled />
+                </Form.Group>}
             <Form.Group className="mb-3" >
                 <Form.Label htmlFor="driverId">Driver ID</Form.Label>
killedBy: DriverAvailabilityForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] ObjectLiteral
main/components/Driver/DriverAvailabilityForm.js:88:45
                     id="endTime"
                     type="text"
                     isInvalid={Boolean(errors.endTime)}
-                    {...register("endTime", {
-                        required: "End Time is required."
-                    })}
+                    {...register("endTime", {})}
                 />
                 <Form.Control.Feedback type="invalid">
killedBy: DriverAvailabilityForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /End Time is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/Driver/DriverAvailabilityForm.js:104:43
                     id="notes"
                     type="text"
                     isInvalid={Boolean(errors.notes)}
-                    {...register("notes", {
-                        required: "Notes are required."
-                    })}
+                    {...register("notes", {})}
                 />
                 <Form.Control.Feedback type="invalid">
killedBy: DriverAvailabilityForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Notes are required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
